Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: The newline character is never treated in any special way in character classes, whatever the setting of the PCRE_DOTALL or PCRE_MULTILINE options is.
es: Cuando se define el emparejamiento sin tener en cuenta mayúsculas y minúsculas (caseless), cualquier letra en una clase representa ambas, por ejemplo, un patrón caseless [aeiou] empareja tanto "A "como "a" y un caseless [^aeiou] no casa con "A "El carácter de nueva línea nunca es tratado de un modo especial en una clase carácter, aunque se hallan definido cualquiera de las opcionesCuando se define el emparejamiento sin tener en cuenta mayúsculas y minúsculas (caseless), cualquier letra en una clase representa ambas, por ejemplo, un patrón caseless [aeiou] empareja tanto "A" como "a "y un caseless [^aeiou] no casa con "A" El carácter de nueva línea nunca es tratado de un modo especial en una clase carácter, aunque se hallan definido cualquiera de las opciones PCRE_DOTALL o PCRE_MULTILINE.

source: A class such as [^a] will always match a newline.
es: Una clase como [^a] siempre casa con una nueva línea.

source: The minus (hyphen) character can be used to specify a rangeThe minus (hyphen) character can be used to specify a range of characters in a character class.
es: El carácter de menos puede ser usado para especificar un rango de caracteresEl carácter de menos puede ser usado para especificar un rango de caracteres en una clase miembro.

source: For example, [d-m]For example, [d-m] matches any letter between d and m, inclusive.
es: Por ejemplo, [d-m] casa con cualquier letra entre dPor ejemplo, [d-m] casa con cualquier letra entre d y m ambas incluidas.

source: If a minus character is required in a class, it must be escaped with a backslash or appear in a position where it cannot be inter - preted as indicating a range, typically as the first or last character in the class.
es: Si un carácter de menos es necesitado en una clase, debe ser precedido por una barra invertida o aparecer en una posición donde no pueda ser interpretado como indicador de una rango, normalmente al inicio o al final de la clase.

source: It is not possible to have the literal character "]" as theIt is not possible to have the literal character "] "as the end character of a range.
es: No es posible tener el carácter literal "]" como el de final de un rango.

source: A pattern such as [W -]46] is interpreted as a class of two characters ("W "and" -") fol - lowed by a literal string "46]", so it would match "W46] "orA pattern such as [W -]46] is interpreted as a class of two characters ("W" and "-") fol - lowed by a literal string "46]", so it would match "W46]" or "-46] ".
es: Un patrón como [W -]46] es interpretado como una clase de dos caracteres ("W "y" -") seguido por la cadena literal "46]", por lo que emparejaría conUn patrón como [W -]46] es interpretado como una clase de dos caracteres ("W "y" -") seguido por la cadena literal "46]", por lo que emparejaría con "W46] "o "-46]".

source: However, if the "]" is escaped with a backslash it is interpreted as the end of range, so [W-\]46] is inter - preted as a single class containing a range followed by twoHowever, if the "] "is escaped with a backslash it is interpreted as the end of range, so [W-\]46] is inter - preted as a single class containing a range followed by two separate characters.
es: Sin embargo, si el carácter "]" es precedido con una barra invertida es tomado por el final del rango, así [W-\]46] es interpretadoSin embargo, si el carácter "] "es precedido con una barra invertida es tomado por el final del rango, así [W-\]46] es interpretado como una clase conteniendo un rango seguido por dos caracteres.

source: The octal or hexadecimal representation of "]" can also be used to end a range.
es: La representación octal o hexadecimal de "]" puede ser usada para finalizar un rango.

source: Ranges operate in ASCII collating sequence.
es: Los rangos trabajan en la secuencia ASCII.

source: They can also be used for characters specified numerically, for exampleThey can also be used for characters specified numerically, for example [\000-\037].
es: Se pueden especificar medianteSe pueden especificar mediante la representación numérica de los mismos, por ejemplo [\000-\037].

source: If a range that includes letters is used when caseless matching is set, it matches the letters in eitherIf a range that includes letters is used when caseless matching is set, it matches the letters in either case.
es: Si un rango que incluye letras es usado cuando es definida la opción de noSi un rango que incluye letras es usado cuando es definida la opción de no tener en cuenta mayúsculas y minúsculas casan ambas.

source: For example, [W-c] is equivalent to [][\^_`wxyzabc], matched caselessly, and if character tables for the "fr "locale are in use, [\xc8-\xcb] matches accented E characters in both cases.
es: Por ejemplo, [W-c] es equivalente a [][\^_`wxyzabc], teniendo en cuenta mayúsculas y minúsculas, y si la tabla de caracteres para la región "fr "es usada, entonces [\xc8-\xcb] empareja los caracteres E acentuados en ambos casos.

source: The character types \d, \D, \s, \S, \w, and \W may also appear in a character class, and add the characters thatThe character types \d, \D, \s, \S, \w, and \W may also appear in a character class, and add the characters that they match to the class.
es: Por ejemplo, [\dABCDEF] casa cualquier dígito hexadecimal.

source: A circumflex can conveniently be used with the upper case character types to specify a more res - tricted set of characters than the matching lower case type.
es: Un circunflejo puede ser usado convenientemente con el tipo de carácter mayúsculo para especificar un conjunto más restrictivo de caracteres que el de un casamientoUn circunflejo puede ser usado convenientemente con el tipo de carácter mayúsculo para especificar un conjunto más restrictivo de caracteres que el de un casamiento con tipo de carácter minúsculo.

source: For example, the class [^\W_] matches any letter or digit, but not underscore.
es: Por ejemplo, la clase [^\W_] empareja cualquier letra o digito pero no el subrayado.

source: All non-alphanumeric characters other than\, -, ^ (at the start) and the terminating] are non-special in character classes, but it does no harm if they are escaped.
es: Todos los caracteres no alfanuméricos y los diferentes a\, -, ^ (al principio) y] no tienen un significado especial en una clase, y éstos tampoco si son definidos convenientemente.

source: Vertical bar characters are used to separate alternativeVertical bar characters are used to separate alternative patterns.
es: BARRA VERTICAL Los caracteres de barra vertical son usados para separar patronesBARRA VERTICAL Los caracteres de barra vertical son usados para separar patrones alternativos.

source: For example, the pattern gilbert_BAR_ sullivanFor example, the pattern gilbert_BAR_sullivan matches either "gilbert "or "sullivan".
es: Por ejemplo, el patrón gilbert_BAR_ sullivanPor ejemplo, el patrón gilbert_BAR_sullivan casa con "gilbert "o "sullivan".

source: Any number of alternatives may appear, and an empty alternative is permittedAny number of alternatives may appear, and an empty alternative is permitted (matching the empty string).
es: Cualquier cantidad de opciones pueden ser implementadas, y una alternativa vacía se permite (emparejando laCualquier cantidad de opciones pueden ser implementadas, y una alternativa vacía se permite (emparejando la cadena vacía).

source: The matching process tries each alternative in turn, from left to right, and the firstThe matching process tries each alternative in turn, from left to right, and the first one that succeeds is used.
es: Si las alternativas están dentro de un subpatrón, "valga" significa que casa el resto del patrón principal como también la alternativa en el subpatrón.

source: If the alternatives are within a subpattern (defined below), "succeeds "means matching the rest of the main pattern as well as the alternative in the subpattern.
es: DEFINIENDO LAS OPCIONES INTERNAS Las definiciones de PCRE_CASELESS, PCRE_MULTILINE, PCRE_DOTALL, y PCRE_EXTENDED pueden ser cambiadas desde dentro del patrón mediante una secuencia de letras de opciones de Perl encerradas entre "(?" y ") ".

source: The settings of PCRE_CASELESS, PCRE_MULTILINE, PCRE_DOTALL, and PCRE_EXTENDED can be changed from within the pattern by a sequence of Perl option letters enclosed between "(?" andThe settings of PCRE_CASELESS, PCRE_MULTILINE, PCRE_DOTALL, and PCRE_EXTENDED can be changed from within the pattern by a sequence of Perl option letters enclosed between "(? "and ")".
es: Las letras de opciones son i para PCRE_CASELESS m para PCRE_MULTILINE s para PCRE_DOTALL x para PCRE_EXTENDED Por ejemplo, (?im) define sin tener en cuenta mayúsculas y minúsculas y modoLas letras de opciones son i para PCRE_CASELESS m para PCRE_MULTILINE s para PCRE_DOTALL x para PCRE_EXTENDED Por ejemplo, (?im) define sin tener en cuenta mayúsculas y minúsculas y modo multilínea.

source: It is also possible to unset these options by preceding the letter with a hyphen, and a combined setting and unsetting such as (?im-sx), which sets PCRE_CASELESS and PCRE_MULTILINE while unsetting PCRE_DOTALL and PCRE_EXTENDED, is also permitted.
es: Si una letra aparece antes y después del menos, la opción es eliminada.

source: If a letter appears both before and after the hyphen, the option is unset.
es: El ámbito de estas opciones cambia dependiendo dónde ocurra la definición.

source: The scope of these option changes depends on where in theThe scope of these option changes depends on where in the pattern the setting occurs.
es: Las definiciones que son hechas fuera de subpatrones (como antes), el efecto esLas definiciones que son hechas fuera de subpatrones (como antes), el efecto es el mismo que si la opción se define o elimina al inicio del casamiento.

source: For settings that are outside any subpattern (defined below), the effect is the same as ifFor settings that are outside any subpattern (defined below), the effect is the same as if the options were set or unset at the start of matching.
es: Los siguientes patrones se comportan todos de la misma manera: (?i)abc a(?i)bc ab(?i)c abc(?i) el cual tiene el mismo efecto que compilar el patrón abc con la opciónLos siguientes patrones se comportan todos de la misma manera: (?i)abc a(?i)bc ab(?i)c abc(?i) el cual tiene el mismo efecto que compilar el patrón abc con la opción PCRE_CASELESS.

source: In other words, such "top level" settings apply to the whole pattern (unless there are other changes inside subpatterns).
es: En otras palabras, tales definiciones de "nivel superior" se aplican a todo el patrón (a menos que haya otro cambio dentro delEn otras palabras, tales definiciones de "nivel superior "se aplican a todo el patrón (a menos que haya otro cambio dentro del subpatrón).

source: If there is more than one setting of the same option at top level, the rightmost setting is used.
es: Si hay más de una definición de la misma opción en el mismo nivel superior, la definición más a la derecha se usa.

source: If an option change occurs inside a subpattern, the effectIf an option change occurs inside a subpattern, the effect is different.
es: Esto es un cambio respecto de la conducta de Perl 5.005.

source: An option change inside a subpattern affects only that part of the subpattern that follows it, so (a(?i)b)c matches abc and aBc and no other strings (assuming PCRE_CASELESS is not used).
es: Un cambio de opción dentro de un subpatrón afecta sólo a la parte del subpatrón que lo sigue, por eso (a(?i)b)c empareja abc y aBc y ninguna otra cadena (asumiendo que no es usadoUn cambio de opción dentro de un subpatrón afecta sólo a la parte del subpatrón que lo sigue, por eso (a(?i)b)c empareja abc y aBc y ninguna otra cadena (asumiendo que no es usado PCRE_CASELESS).

source: By this means, options can be made to have different settings in different parts of theBy this means, options can be made to have different settings in different parts of the pattern.
es: De este modo, las opciones pueden ser hechas paraDe este modo, las opciones pueden ser hechas para tener diferente significado en diferente partes del patrón.

source: For example, (a(?i)b_BAR_c) matches "ab", "aB", "c", and "C", even though when matching "C "the first branch is abandoned before the option setting.
es: Por ejemplo, (a(?i)b_BAR_c) empareja "ab", "aB", "c", y "C", siempre y cuando case "C "la primeraPor ejemplo, (a(?i)b_BAR_c) empareja "ab", "aB", "c", y "C", siempre y cuando case "C" la primera opción es abandonada antes de definir la opción.

source: This is because the effects of option settings happen atThis is because the effects of option settings happen at compile time.
es: Esto es porque los efectosEsto es porque los efectos de definiciones de opción ocurren en tiempo de compilación.

source: There would be some very weird behaviour otherwise.
es: De otro modo, éstos sería una conducta muy rara.

source: The PCRE-specific options PCRE_UNGREEDY and PCRE_EXTRA can be changed in the same way as the Perl-compatible options byThe PCRE-specific options PCRE_UNGREEDY and PCRE_EXTRA can be changed in the same way as the Perl-compatible options by using the characters U and X respectively.
es: Las opciones específicas PCRE PCRE_UNGREEDY y PCRE_EXTRA pueden ser cambiadas del mismo modo que las opciones compatibles con Perl usandoLas opciones específicas PCRE PCRE_UNGREEDY y PCRE_EXTRA pueden ser cambiadas del mismo modo que las opciones compatibles con Perl usando los caracteres U y X respectivamente.

source: The (?X) flag setting is special in that it must always occur earlier in the pattern than any of the additional features it turns on,The (?X) flag setting is special in that it must always occur earlier in the pattern than any of the additional features it turns on, even when it is at top level.
es: La bandera (?X) es especial ya que siempre debe aparecer antes que cualquier otra en el patrón, incluso cuandoLa bandera (?X) es especial ya que siempre debe aparecer antes que cualquier otra en el patrón, incluso cuando es definida a nivel superior.

source: It is best put at the start.
es: Es mejor ponerla en el inicio.

source: Subpatterns are delimited by parentheses (round brackets),Subpatterns are delimited by parentheses (round brackets), which can be nested.
es: SUBPATRONES Los subpatrones son delimitados por paréntesis y pueden estar anidados.

source: Marking part of a pattern as a subpattern does two things:
es: Marcando parte de un patrón como un subpatrón permite dos cosas:

source: It localizes a set of alternatives.
es: Define un conjunto de opciones.

source: For example, the pat - tern cat( aract_BAR_erpillar_BAR_) matches one of the words "cat", "cataract", or "caterpillar ".
es: Por ejemplo, el patrón cat( aract_BAR_erpillar_BAR_)Por ejemplo, el patrón cat(aract_BAR_erpillar_BAR_) empareja con "cat", "cataract", or "caterpillar ".

source: Without the parentheses, it would match "cataract", "erpillar" or the empty string.
es: Sin los paréntesis, casaría "cataract", "erpillar" o la cadena vacía.

source: It sets up the subpattern as a capturing subpattern (asIt sets up the subpattern as a capturing subpattern (as defined above).
es: Define el subpatrón como un subpatrón capturado.

source: When the whole pattern matches, that portion of the subject string that matched the subpattern is passed back to the caller via the ovector argument of pcre_exec().
es: Cuando el patrón sea emparejado por completo, esa porción de la cadena de entrada que casa con el subpatrón es devuelta mediante el argumento ovector de pcre_exec().

source: Opening parentheses are counted from left to right (starting from 1) to obtain the numbers of the capturing subpatterns.
es: Los paréntesis abiertos son contados de izquierda a derecha (empezando por uno) para definir los números de subpatrones capturados.

source: For example, if the string "the red king" is matched against the pattern the ((red_BAR_white) (king_BAR_queen)) the captured substrings are "red king", "red", and "king ", and are numbered 1, 2, and 3.
es: Por ejemplo, si la cadena "the red king" es casada con el patrón the ((red_BAR_white) (king_BAR_queen)) las subcadenas capturadas son "red king", "red", y "king "y los números son 1,2 y 3 El hecho de que los paréntesis realicen dos funciones no siempre es útil.

source: The fact that plain parentheses fulfil two functions is notThe fact that plain parentheses fulfil two functions is not always helpful.
es: A menudo, hay veces que un subpatrón agrupado es necesitado sin unaA menudo, hay veces que un subpatrón agrupado es necesitado sin una querer una captura.

source: There are often times when a grouping subpatternThere are often times when a grouping subpattern is required without a capturing requirement.
es: Si un paréntesis abierto le sigue "? :", el subpatrón no hace ninguna captura, y no es contado cuando compute elSi un paréntesis abierto le sigue "?:", el subpatrón no hace ninguna captura, y no es contado cuando compute el número de subpatrones capturados.

source: If an opening parenthesis is followed by "? :", the subpattern does not do any capturing, and is not counted when computing theIf an opening parenthesis is followed by "?:", the subpattern does not do any capturing, and is not counted when computing the number of any subsequent capturing subpatterns.
es: Por ejemplo, si la cadena "the white queen" es casada con el patrón the ((?:red_BAR_white) (king_BAR_queen)) las subcadenas capturadas son "white queen "y "queen" y son numeradas comoPor ejemplo, si la cadena "the white queen "es casada con el patrón the ((?:red_BAR_white) (king_BAR_queen)) las subcadenas capturadas son "white queen" y "queen "y son numeradas como 1 y 2.

source: The maximum number of captured substrings is 99, and the maximum number of all subpatterns, both capturing and non-capturing, is 200.
es: Como un atajo, si cualquier definición de opción es necesitada al inicio de un subpatrón no capturado, las letras de opciones pueden aparecer entreComo un atajo, si cualquier definición de opción es necesitada al inicio de un subpatrón no capturado, las letras de opciones pueden aparecer entre "?" y ":".

source: Thus the two patterns (?i:saturday_BAR_sunday) (? :(?i)saturday_BAR_sunday)Thus the two patterns (?i:saturday_BAR_sunday) (? :(?i)saturday_BAR_sunday) match exactly the same set of strings.
es: Ya que las alternativas son intentadas de izquierda a derecha, y las opciones no son dejadas de tener en cuenta hasta que el final de subpatrón se alcanza, una definición de opción en una alternativa afecta al resto, por eso el patrón anterior empareja tanto con "SUNDAY" como con "Saturday ".

source: Repetition is specified by quantifiers, which can follow any of the following items: a single character, possibly escaped the. metacharacter a character class a back reference (see next section) a parenthesized subpattern (unless it is an assertion - see below) The general repetition quantifier specifies a minimum and maximum number of permitted matches, by giving the two numbers in curly brackets (braces), separated by a comma.
es: REPETICION La repetición es especificada por cuantificadores, la cual puede utilizarla cualquiera de los siguientes elementos: un carácter, posiblemente precedido por el meta carácter. una clase carácter una referencia atrás (ver la próxima sección) un subpatrón con paréntesis (a menos que sea una sentencia, ver más adelante) El cuantificador de repetición general indica un número mínimo y un máximo de casamientos permitidos, dando los dos números entre llaves, separadosREPETICION La repetición es especificada por cuantificadores, la cual puede utilizarla cualquiera de los siguientes elementos: un carácter, posiblemente precedido por el meta carácter. una clase carácter una referencia atrás (ver la próxima sección) un subpatrón con paréntesis (a menos que sea una sentencia, ver más adelante) El cuantificador de repetición general indica un número mínimo y un máximo de casamientos permitidos, dando los dos números entre llaves, separados por coma.

source: The numbers must be less than 65536, and the first must beThe numbers must be less than 65536, and the first must be less than or equal to the second.
es: El número debe ser menor que 65536, y el primero debe ser menorEl número debe ser menor que 65536, y el primero debe ser menor o igual que el segundo.

source: For example: z{ 2,4}For example: z{2,4} matches "zz", "zzz", or "zzzz ".
es: Por ejemplo: z{ 2,4}Por ejemplo: z{2,4} casa con "zz", "zzz", o "zzzz ".

source: A closing brace on its ownA closing brace on its own is not a special character.
es: Una llave de cierre por si misma no es unUna llave de cierre por si misma no es un carácter especial.

source: If the second number is omitted, but the comma is present, there is no upper limit; if the second number and the comma are both omitted, the quantifierIf the second number is omitted, but the comma is present, there is no upper limit; if the second number and the comma are both omitted, the quantifier specifies an exact number of required matches.
es: Si el segundo número es omitido, pero aparece la coma, entonces no hay límite superior; si el segundo número y la coma sonSi el segundo número es omitido, pero aparece la coma, entonces no hay límite superior; si el segundo número y la coma son omitidos, el cuantificador indica el número exacto de repeticiones.

source: Thus [aeiou]{3,} matches at least 3 successive vowels, but may match many more, while \d{8}Thus [aeiou]{3,} matches at least 3 successive vowels, but may match many more, while \d{8} matches exactly 8 digits.
es: Así [aeiou]{3,} empareja al menos tres vocales seguidas, pero pueden ser muchas más, mientras \d{8}Así [aeiou]{3,} empareja al menos tres vocales seguidas, pero pueden ser muchas más, mientras \d{8} casa exactamente ocho dígitos.

source: An opening curly bracket that appears in a position where a quantifier is not allowed, or one that does not match the syntax of a quantifier, is takenAn opening curly bracket that appears in a position where a quantifier is not allowed, or one that does not match the syntax of a quantifier, is taken as a literal character.
es: Una llave abierta en una posición donde un cuantificador no es permitido o una que no empareje con la sintaxis de unUna llave abierta en una posición donde un cuantificador no es permitido o una que no empareje con la sintaxis de un cuantificador es tomada como un carácter literal.

source: For example, {,6} is not a quantifier, but a literal string of four characters.
es: Por ejemplo, {,6} no es un cuantificador, pero sí una cadena literal de cuatro caracteres.

source: The quantifier {0} is permitted, causing the expression to behave as if the previous item and the quantifier were not present.
es: Se permite el cuantificado {0}, provocando que la expresión se comporte como si el elemento anterior y el cuantificador no estuvieran presentes.
